WELCOME_DONT_HAVE_VPN = """
✋ Рады видеть вас снова, {user}
⏳ Ваш аккаунт не активен! Оплатите тариф, нажав на кнопку "Купить VPN"
"""

FIRST_TIME = """
Привет, {user}!
Подключите VPN бесплатно! Дарим вам 50₽ на баланс!
🚀 высокая скорость
🐉 официальный клиент WireGuard
💃🏿 доступ ко всем сайтам
💳 оплата картами РФ 🇷🇺 
💰 самая низкая цена на рынке! 
👭 Пригласите друзей  и получите 50₽ на баланс за каждого друга. Ваши друзья так же получат 50₽ на баланс!
⬇️ ⬇️ ⬇️ Жмите кнопку! ⬇️ ⬇️ ⬇️
"""

WELCOME_HAVE_VPN = """
✋ Рады видеть вас снова, {user}
⏳ Ваш аккаунт активен
❗️ Если вы потеряли QR код или конфиг файл - вы можете повторно их скачать, нажав на кнопку "Мои VPN".
"""

CONGRATULATIONS = """
Поздравляем, вы активировали аккаунт VPN15, 50₽ у вас на балансе!
Теперь давайте настроим ваш VPN. Выберите тип вашего устройства:
"""

NO_VPN_TEXT = """
🚫 
 ⏳ Ваш аккаунт не активен! Пополните "Баланс" либо оплатите тариф, нажав на кнопку "Купить VPN" """

ANDROID = """
1️⃣ Установите приложение Wireguard (https://play.google.com/store/apps/details?id=com.wireguard.android&hl=ru&gl=US&pli=1)

2️⃣ Нажмите на конфиг файл VPN15*.conf и скачайте его 

3️⃣ Запустите программу Wireguard и нажмите ➕ внизу экрана справа

4️⃣ Нажмите кнопку “Импорт из файла или архива”, выберите скачанный конфиг файл из папки загрузок

5️⃣ Также вы можете переслать QR код на другое устройство и отсканировать его из программы Wireguard, нажав ➕.

6️⃣ Включите тумблер.

7️⃣ Введите имя туннеля VPN15

⚠️ Oдин и тот же QR код и конфиг файл можно использовать только на одном устройстве!
"""

IPHONE = """
1️⃣ Установите приложение Wireguard

2️⃣ Нажмите на конфиг файл VPN15*.conf

3️⃣ В правом верхнем углу нажмите стрелку "Поделиться"

4️⃣ В списке программ выберите Wireguard

5️⃣ Также вы можете переслать QR код на другое устройство и отсканировать его из программы Wireguard, нажав ➕.

6️⃣ Включите тумблер

7️⃣ Введите имя туннеля VPN15

⚠️ Oдин и тот же QR код и конфиг файл можно использовать только на одном устройстве!
"""

WRITE_TO_HELP = """
Время ответа на запрос в службу поддержки может составлять до 2-х часов, в рабочее время по Московскому времени.
@proktor
"""


SEND_CONFIG_MSG = """
{name}
Статус: {enable}
Осталось дней: {days}
"""



UP_BALANCE = """
Ваш VPN отключится через 3 дня.
для того, чтобы мы не отключили ваш ключ — пополните его в разделе "баланс", либо получите новый ключ в разделе "Купить VPN"
"""
